from telegram.ext import (
    ContextTypes,
)

SBP_PHONE="+7-967-552-5410"

THANKS_HTML = (
    "🙏 <b>Как сказать спасибо</b>\n\n"
    "Если бот оказался полезным и ты хочешь поддержать проект, "
    "можно отправить благодарность переводом через <b>СБП</b>.\n\n"
    "1) Открой приложение своего банка.\n"
    "2) Выбери перевод по <b>СБП</b>.\n"
    "3) Укажи номер телефона:\n"
    f"<b>{SBP_PHONE}</b>\n"
    "4) <b>Комментарий к переводу указывать не нужно</b>.\n\n"
    "Спасибо за поддержку — она помогает развивать сервис и делать его лучше ❤️"
)

# бесплатный тариф
async def common(chat_id, context: ContextTypes.DEFAULT_TYPE):
    await context.application.bot.send_message(
        chat_id=chat_id,
        text=THANKS_HTML,
        parse_mode="HTML",
        disable_web_page_preview=True,
    )
    return